Project/Toir/src/InformationRegisters/торо_Переводы/торо_Переводы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Переводы</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.торо_Языки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВыявленныеДефекты</name>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.торо_СостоянияОбъектовРемонта</basedOn>
  <basedOn>Document.торо_УчетКонтролируемыхПоказателей</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Влияние</name>
    <type>
      <types>EnumRef.гкс_Влияние</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаУтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДефектОформленПоТАГ</name>
    <comment>TOIR20-454</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НарядЗаданиеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КатегорияРиска</name>
    <type>
      <types>CatalogRef.торо_КатегорииРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КачественнаяОценка</name>
    <comment>TOIR20-576</comment>
    <type>
      <types>EnumRef.гкс_КачественнаяОценкаКритичности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерТАГ</name>
    <comment>TOIR20-454</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОписаниеДефектаСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Приоритет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СимптомДефекта</name>
    <type>
      <types>CatalogRef.гкс_СимптомыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СпециализацияТехническогоСпециалиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СрочностьВоздействия</name>
    <comment>8220 Тарасов</comment>
    <type>
      <types>EnumRef.гкс_СрочностьВоздействия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_IDОбращенияАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерОбращенияАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.торо_ВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйОбъект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_СимптомДефекта</name>
      <type>
        <types>CatalogRef.гкс_СимптомыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_КорневаяПричина</name>
      <type>
        <types>CatalogRef.гкс_КорневыеПричины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныеЛица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <attributes>
      <name>ID_Ремонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ФайлыФиксации</name>
    <comment>TOIR20-598</comment>
    <attributes>
      <name>НаименованиеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/CommonModules/торо_Локализация/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает макет печатной формы по полному пути к макету.
//
// Параметры:
//  ПутьКМакету - Строка - полный путь к макету в формате:
//                         "Документ.<ИмяДокумента>.<ИмяМакета>"
//                         "Обработка.<ИмяОбработки>.<ИмяМакета>"
//                         "ОбщийМакет.<ИмяМакета>".
// Возвращаемое значение:
//  ТабличныйДокумент - для макета типа MXL.
//  ДвоичныеДанные    - для макетов офисных документов.
//
Функция МакетПечатнойФормы(ПутьКМакету) Экспорт
	ЛокализованныеФормы = торо_Локализация.ЛокализуемыеПечатныеФормы();
	
	Если ЛокализованныеФормы.Найти(ПутьКМакету) <> Неопределено Тогда
		КодЯзыка = ТекущийЯзык().КодЯзыка;
		ПутьКМакету = СтрШаблон("%1_%2", ПутьКМакету, КодЯзыка);
	КонецЕсли; 

	Макет = УправлениеПечатью.МакетПечатнойФормы(ПутьКМакету);
	
	Возврат Макет;
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [06.11.2019]
Процедура ОбработкаПолученияПредставленияОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	
	Возврат;
		
КонецПроцедуры
// << [Деснол] [Ушаков А.Д.] [06.11.2019] 

Процедура СохранитьЯзыкТекущегоПользователя(Язык) Экспорт
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	НовыйЯзык = Неопределено;
	
	Для каждого ЯзыкМетаданных Из Метаданные.Языки Цикл
		Если ЯзыкМетаданных.КодЯзыка = Язык.Код Тогда
			НовыйЯзык = ЯзыкМетаданных;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 

	// >> [Деснол] [Ушаков А.Д.] [25.10.2019] 
	УстановитьПривилегированныйРежим(Истина);
	// << [Деснол] [Ушаков А.Д.] [25.10.2019] 
	Если НовыйЯзык <> Неопределено Тогда
		ТекущийПользователь.Язык = НовыйЯзык;
		ТекущийПользователь.Записать();
	КонецЕсли; 
КонецПроцедуры

// Заглушка. Не используется
Процедура ОбработкаПолученияДанныхВыбораОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	Возврат;
	Если Не ЭтоЯзыкПоУмолчанию() Тогда
		Слова = СтрРазделить(Источник, ".");
		Тип = Слова[0];
		ОбъектИБ = Слова[1];
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Если Тип = "СправочникМенеджер" Тогда
			Запрос = Новый Запрос;
			#Область ТекстЗапроса
			Запрос.Текст = СтрШаблон(
				"ВЫБРАТЬ
				|	СправочникИБ.Ссылка КАК Ссылка,
				|	торо_Переводы.Текст КАК Представление
				|ИЗ
				|	РегистрСведений.торо_Переводы КАК торо_Переводы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.%1 КАК СправочникИБ
				|		ПО торо_Переводы.ID = СправочникИБ.Ссылка
				|			И (торо_Переводы.Реквизит = ""Наименование"")
				|			И (торо_Переводы.Язык.Код = &Язык)
				|ГДЕ
				|	торо_Переводы.Текст ПОДОБНО &Наименование", ОбъектИБ);
			#КонецОбласти 
			
			Запрос.УстановитьПараметр("Язык", ТекущийЯзык().КодЯзыка);
			Запрос.УстановитьПараметр("Наименование", "%" + Параметры.СтрокаПоиска + "%");
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура ОбработкаПолученияФормыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	Возврат;
	Если Не ЭтоЯзыкПоУмолчанию() Тогда
		Если ЭтоПользовательскаяФорма(Источник, ВидФормы) Тогда
			Возврат;
		КонецЕсли;

		Параметры.Вставить("ВидФормы", ВидФормы);
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			#Область ФормаОбъекта
			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";
			
			Ключ = Неопределено;
			Если Параметры.Свойство("Ключ", Ключ) Тогда
				Параметры.Вставить("Ключ", Ключ.ПолучитьОбъект());
			Иначе
				МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
				ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
				ТипМетаданных = МетаданныеИсточника.ТипМетаданных;
				
				Если ТипМетаданных = "Справочники" Тогда
					НовыйЭлемент = Справочники[ТипОбъектаИБ].СоздатьЭлемент();
				ИначеЕсли ТипМетаданных = "Документы" Тогда
					НовыйЭлемент = Документы[ТипОбъектаИБ].СоздатьДокумент();
				КонецЕсли;
				
				Параметры.Вставить("Ключ", НовыйЭлемент);
			КонецЕсли; 
			#КонецОбласти 
		ИначеЕсли ВидФормы = "ФормаСписка" ИЛИ ВидФормы = "ФормаВыбора" Тогда
			#Область ФормаСписка
			МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
			ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
			ТипМетаданных = МетаданныеИсточника.ТипМетаданных;
			Если СтрНайти(ТипМетаданных,"Документ") = 0 И СтрНайти(ТипМетаданных,"Справочник") = 0 Тогда 
				Возврат;
			ИначеЕсли СтрНайти(ТипМетаданных,"Регистр") > 0 Тогда 
				Возврат;
			КонецЕсли;
			Параметры.Вставить("ТипОбъектаИБ", ТипОбъектаИБ);
			Параметры.Вставить("ТипМетаданных", ТипМетаданных);
			
			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";
			#КонецОбласти 
		ИначеЕсли ВидФормы = "ФормаЗаписи" Тогда
			#Область ФормаЗаписи
			Возврат;
			МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
			ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
			ТипМетаданных = МетаданныеИсточника.ТипМетаданных;
			МассивИзмерений = Новый Массив();
			МассивРесурсов = Новый Массив();
			МассивРеквизитов = Новый Массив();
			Параметры.Вставить("ТипМетаданных", ТипМетаданных);
			
			Если ТипМетаданных = "РегистрыСведений" Тогда
				НовыйЭлемент = РегистрыСведений[ТипОбъектаИБ].СоздатьМенеджерЗаписи();
			Иначе
				Возврат;
			КонецЕсли;
			
			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";
			
			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Измерения Цикл
				МассивИзмерений.Добавить(Измерение.Имя);
			КонецЦикла;
			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Ресурсы Цикл
				МассивРесурсов.Добавить(Измерение.Имя);
			КонецЦикла;
			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Реквизиты Цикл
				МассивРесурсов.Добавить(Измерение.Имя);
			КонецЦикла;
			Параметры.Вставить("МассивИзмерений", МассивИзмерений);
			Параметры.Вставить("МассивРесурсов", МассивРесурсов);
			Параметры.Вставить("МассивРеквизитов", МассивРеквизитов);
			Параметры.Вставить("ТипОбъектаИБ", ТипОбъектаИБ);
			
			Ключ = Неопределено;
			Если Параметры.Свойство("Ключ", Ключ) Тогда
				Если Не ТипЗнч(Ключ.Регистратор) = Тип("Неопределено") Тогда 
					НовыйЭлемент.Регистратор = Ключ.Регистратор;
				Иначе
					Для Каждого Измерение Из МассивИзмерений Цикл
						НовыйЭлемент[Измерение] = Ключ[Измерение];
					КонецЦикла;
				КонецЕсли;
				НовыйЭлемент.Прочитать();
				Параметры.Вставить("Ключ", НовыйЭлемент);
			Иначе
				Параметры.Вставить("Ключ", НовыйЭлемент);
			КонецЕсли;
			#КонецОбласти 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

// [Возвращает результаты полнотекстового поиска] 
Функция ПолучитьРезультатыПоиска(СтрокаПоиска, РезультатПоиска, ТочноеСовпадение = Ложь) Экспорт
	Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_Переводы.ID КАК Номенклатура
		|ИЗ
		|	РегистрСведений.торо_Переводы КАК торо_Переводы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО (Номенклатура.Ссылка = торо_Переводы.ID)
		|ГДЕ
		|	торо_Переводы.Текст ПОДОБНО &Текст
		|	И торо_Переводы.Язык = &Язык
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование ПОДОБНО &Текст";
	
	//Если ТочноеСовпадение Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОДОБНО", "=");
	//КонецЕсли; 
	
	Запрос.УстановитьПараметр("Текст", ?(ТочноеСовпадение, СтрокаПоиска, "%" + СтрокаПоиска + "%"));
	Запрос.УстановитьПараметр("Язык", Язык);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		РезультатПоиска.КодОшибки = "НичегоНеНайдено";
	ИначеЕсли Выборка.Количество() > 1000 Тогда
		РезультатПоиска.КодОшибки = "СлишкомМногоРезультатов";
	Иначе
		Пока Выборка.Следующий() Цикл
			РезультатПоиска.Номенклатура.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатПоиска;
КонецФункции

#Область Вспомогательное

Функция ПолучитьЯзыки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_Языки.Ссылка КАК Ссылка,
		|	торо_Языки.Код КАК Код
		|ИЗ
		|	Справочник.торо_Языки КАК торо_Языки";
	
	ТаблицаЯзыков = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЯзыков;
КонецФункции  

Функция ПолучитьЯзыкиМассивом() Экспорт
	ТаблицаЯзыков = ПолучитьЯзыки();
	МассивЯзыков = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЯзыков);
	
	Возврат МассивЯзыков;
КонецФункции  

Функция ПолучитьЗначениеИзСтроки(Строка) Экспорт
	Возврат ЗначениеИзСтрокиВнутр(Строка);
КонецФункции // ПолучитьЗначениеИзСтроки()

#КонецОбласти 

#КонецОбласти 

#Область ФормыВспомогательное

Функция ЭтоПользовательскаяФорма(Источник, ВидФормы)
	ЭтоПользовательскаяФорма = Ложь;
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
	Формы = Метаданные[МетаданныеИсточника.ТипМетаданных][МетаданныеИсточника.ТипОбъектаИБ].Формы;
	
	СоответствиеФорм = Новый Соответствие;
	// >> [Деснол] [Ушаков А.Д.] [20.09.2019] 
	СоответствиеФорм.Вставить("ФормаОбъекта", 	СтрРазделить("ФормаЭлемента,ФормаДокумента", ","));
	СоответствиеФорм.Вставить("ФормаВыбора", 	СтрРазделить("ФормаВыбора", ","));
	// << [Деснол] [Ушаков А.Д.] [20.09.2019] 
	СоответствиеФорм.Вставить("ФормаСписка", 	СтрРазделить("ФормаСписка", ","));
	
	НазваниеВидаФормы = СоответствиеФорм[ВидФормы];
	
	Если НазваниеВидаФормы <> Неопределено Тогда
		Для каждого Форма Из Формы Цикл
			Если НазваниеВидаФормы.Найти(Форма.Имя) <> Неопределено Тогда
				ЭтоПользовательскаяФорма = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат ЭтоПользовательскаяФорма;
КонецФункции

// [Недоработана] 
Функция ПолучитьМетаданныеИсточника(Источник)
	ПодстрокиТипа = СтрРазделить(Источник, ".");
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("СправочникМенеджер", 		"Справочники");
	СоответствиеТипов.Вставить("ДокументМенеджер", 			"Документы");
	СоответствиеТипов.Вставить("РегистрСведенийМенеджер", 	"РегистрыСведений");
	
	ТипМетаданных = СоответствиеТипов[ПодстрокиТипа[0]];
	ТипОбъектаИБ = ПодстрокиТипа[1];
	
	МетаданныеИсточника = Новый Структура("ТипМетаданных,ТипОбъектаИБ", ТипМетаданных, ТипОбъектаИБ);
	
	Возврат МетаданныеИсточника;
КонецФункции

// Возвращает масиив имен макетов, доступных к локализации
Функция ЛокализуемыеПечатныеФормы() Экспорт
	ПечатныеФормы = Новый Массив;
	
	ПечатныеФормы.Добавить("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ДефектнаяВедомость");
	
	Возврат ПечатныеФормы;
КонецФункции

Функция ТекущийЯзыкИБ() Экспорт
	Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);
	Возврат Язык;
КонецФункции

// Проверяет, является ли текущий язык языком по умолчанию 
Функция ЭтоЯзыкПоУмолчанию() Экспорт
	ТекущийЯзыкЭтоЯзыкПоУмолчанию = ПараметрыСеанса.торо_ТекущийЯзыкЭтоЯзыкПоУмолчанию;
	Возврат ТекущийЯзыкЭтоЯзыкПоУмолчанию;
КонецФункции
#КонецОбласти
